/* default status bar string when no page is showing (the no home page case) */
"" = "";

/* format used for recent searches for the search field menu */
"  %@" = "  %@";

/* The format for hours and minutes in 12 hour format */
"%1I:%M" = "%1I:%M";

/* title for error dialog displayed when a built-in file could not be located (nib corrupted?) */
"%@ not found" = "%@ ei löydy";

/* activity window string for object where the expected size is not known */
"%@ of ?" = "%@ / ?";

/* Status field in Downloads representing total transferred and download rate. */
"%@ — %@ per sec." = "%@ — %@ per sekunti";

/* date format used for History menu */
"%A, %B %e" = "%A, %B %e";

/* Date format with arguments full month name, day, and year */
"%B %e, %Y" = "%B %e, %Y";

/* Date format with arguments full month, day, and year, to be followed by time */
"%B %e, %Y " = "%B %e, %Y ";

/* The format for hours and minutes in 24 hour format */
"%H:%M" = "%H:%M";

/* Date format with arguments abbreviated month name, day, and year */
"%b %e, %Y" = "%b %e, %Y";

/* Date format with arguments abbreviated month name, day, and year, to be followed by time */
"%b %e, %Y " = "%b %e, %Y ";

/* Total field of Downloads window when there is more than 1 download */
"%d Downloads" = "%d hakua";

/* item count in activity window */
"%d items (%d errors)" = "%d kohdetta (%d virhettä)";

/* item count in activity window */
"%d items (activity window)" = "%d kohdetta";

/* displayed count for bookmark folder that contains more than one item in bookmarks view */
"%d items (bookmarks view)" = "%d kohdetta";

/* item count in activity window */
"%d of %d items" = "%d / %d kohdetta";

/* item count in activity window */
"%d of %d items (%d errors)" = "%d / %d kohdetta (%d virhettä)";

/* item count in activity window */
"%d of %d items (1 error)" = "%d / %d kohdetta (1 virhe)";

/* Date format with arguments month number, day, and year */
"%m/%d/%Y" = "%d.%m.%Y";

/* Date format with arguments month number, day, and year, to be followed by time */
"%m/%d/%Y " = "%d.%m.%Y ";

/* Date format with arguments month number, day, and year */
"%m/%d/%y" = "%d.%m.%y";

/* Date format with arguments month number, day, and year, to be followed by time */
"%m/%d/%y " = "%d.%m.%y ";

/* Argument is the AM/PM designator */
"%p" = "%p";

/* displayed name for Address Book entry with no composite name */
"(no name)" = "(nimetön)";

/* displayed count for empty bookmark folder in bookmarks view */
"0 items (bookmarks view)" = "0 kohdetta";

/* item count in activity window */
"0 of 1 item" = "0 / 1 kohde";

/* Total field of Downloads window when there is 1 download */
"1 Download" = "1 haku";

/* item count in activity window */
"1 item (activity window)" = "1 kohde";

/* displayed count for bookmark folder that contains 1 item in bookmarks view */
"1 item (bookmarks view)" = "1 kohde";

/* item count in activity window */
"1 item (error)" = "1 kohde (virhe)";

/* About Rendezvous table item in the Rendezvous window */
"About Rendezvous" = "Tietoja: Rendezvous";

/* context menu item */
"Add Link to Bookmarks" = "Lisää linkki kirjanmerkkeihin";

/* submenu title in Bookmarks menu */
"Address Book" = "Osoitekirja";

/* displayed title of special bookmark that shows Address Book home pages */
"Address Book (bookmark proxy)" = "Osoitekirja";

/* action name for Undo item when a bookmark address has been changed */
"Address Change" = "Muutos osoitteessa";

/* preference panel name */
"Advanced" = "Lisävalinnat";

/* message of dialog that appears when an unexpected error occurs while trying to save bookmarks to disk */
"An unexpected problem occurred while saving bookmarks." = "Tapahtui odottamaton virhe kirjanmerkkien tallennuksessa.";

/* preference panel name */
"Appearance" = "Ulkoasu";

/* The default (yes) response to the question asking whether to append '.txt' extension to a filename which already seems to have one */
"Append" = "Lisää";

/* Title for confirmation sheet when user checks 'Block pop-up windows' */
"Are you sure you want to change this setting?" = "Haluatko varmasti muuttaa asetusta?";

/* title for Empty Cache confirmation alert */
"Are you sure you want to empty the cache?" = "Haluatko varmasti tyhjentää välimuistin?";

/* title for Remove All Cookies confirmation alert */
"Are you sure you want to remove all cookies?" = "Haluatko varmasti poistaa kaikki evästeet?";

/* title for Reset Safari confirmation alert */
"Are you sure you want to reset Safari?" = "Haluatko varmasti nollata Safarin?";

/* Title for sheet warning of re-posting form data */
"Are you sure you want to send a form again?" = "Haluatko varmasti lähettää lomakkeen uudelleen?";

/* Status field in Downloads when a DiskCopy image is requesting authentication. */
"Authenticating" = "Autentikoin";

/* Title for Auto-Tab column in bookmarks view, present only when viewing Bookmarks Bar contents */
"Auto-Tab" = "Auto-Tab";

/* preference panel name */
"AutoFill" = "AutoFill";

/* Message in sheet shown when AutoFill has no matches for the form on this page. */
"AutoFill completes web page forms using information from your Address Book card or from web forms you completed previously. The information required by this form does not match any of the information available to AutoFill." = "AutoFill täydentää web-sivujen lomakkeet Osoitekirjan tiedoilla tai lomakkeiden tiedoilla, jotka olet täyttänyt aiemmin. Tämän lomakkeen tarvitsemat tiedot eivät vastaa aiempia AutoFillin käyttämiä tietoja.";

/* Message in sheet shown when AutoFill finds no form to operate on. */
"AutoFill completes web page forms using information from your Address Book card or from web forms you completed previously. This page has no forms to complete." = "AutoFill täydentää web-sivujen lomakkeet Osoitekirjan tiedoilla tai lomakkeiden tiedoilla, jotka olet täyttänyt aiemmin. Tällä sivulla ei ole täytettäviä lomakkeita.";

/* Title of sheet shown when AutoFill has no matches for the form on this page. */
"AutoFill did not complete anything." = "AutoFill ei täydentänyt mitään.";

/* preference panel name */
"Bookmarks (preference panel)" = "Kirjanmerkit";

/* Title of window or tab when showing bookmarks */
"Bookmarks (window title)" = "Kirjanmerkit";

/* displayed title of special bookmarks folder that is used for favorites bar contents */
"Bookmarks Bar" = "Kirjanmerkkipalkki";

/* displayed title of special bookmarks folder that is used for menu contents */
"Bookmarks Menu" = "Kirjanmerkkivalikko";

/* Title for a normal Cancel button */
"Cancel" = "Kumoa";

/* status bar message when page load was cancelled */
"Cancelled opening the page" = "Sivun avaus kumottu";

/* error message for URL with unsupported scheme, like xxx:yyy */
"Cannot go to “%@”, because Mac OS X doesn’t recognize addresses starting with “%@:”." = "Ei voida siirtyä sivulle ”%@”, koska Mac OS X ei tunnista ”%@:” alkavia osoitteita.";

/* message for file URL without an appropriate application */
"Cannot open the file “%@” because Mac OS X doesn’t know which application to use." = "Ei voida avata tiedostoa ”%@”, koska Mac OS X ei tunnista tarvittavaa sovellusta.";

/* error message for using JavaScript somewhere it's not allowed */
"Cannot run the script “%@” because Safari does not allow JavaScript to be used in this way." = "Ei voida suorittaa skriptiä ”%@”, koska Safari ei salli JavaScriptin käyttöä tällä tavalla.";

/* title of panel */
"Can’t Open Bookmark" = "Kirjanmerkkiä ei voida avata";

/* title of sheet displayed for WebFoundationErrorCannotConnectToHostError */
"Can’t connect to server." = "Ei voida ottaa yhteyttä palvelimeen.";

/* panel title for file URL for nonexistent file */
"Can’t find file." = "Tiedostoa ei löydy.";

/* panel title for URL with unsupported scheme */
"Can’t go to address" = "Ei voida siirtyä osoitteeseen";

/* panel title for file URL without an appropriate application */
"Can’t open file" = "Tiedostoa ei voida avata";

/* panel title for file URL for folder that can’t be opened */
"Can’t open folder" = "Kansiota ei voida avata";

/* panel title for using JavaScript somewhere it's not allowed */
"Can’t use JavaScript here" = "JavaScriptiä ei voida käyttää tässä";

/* title for button in open panel from file button used in HTML forms */
"Choose (HTML form open panel)" = "Valitse";

/* button title in open panel for choosing user style sheet preference */
"Choose (style sheet open panel)" = "Valitse";

/* Status field in Downloads when a DiskCopy image is cleaning up. */
"Cleaning up" = "Siivoan";

/* menu item in Recent Searches menu that empties menu's contents */
"Clear Entries" = "Tyhjennä syötöt";

/* title for menu item that erases history from menu and bookmarks view */
"Clear History" = "Tyhjennä historia";

/* tooltip for auto-tab folder in bookmarks bar */
"Click to open the bookmarks in this folder in tabs." = "Osoita, jos haluat avata kansion kirjanmerkit välilehdillä";

/* tooltip for favorite bar bookmarks for folders */
"Click to see the bookmarks in this folder." = "Osoita, jos haluat nähdä kansion kirjanmerkit";

/* context menu item */
"Close Other Tabs" = "Sulje muut välilehdet";

/* context menu item */
"Close Tab" = "Sulje välilehti";

/* status bar message when page load finishes with multiple errors */
"Completed opening the page with %d errors (see Activity window for details)" = "Sivun avaaminen päättynyt %d virheellä (katso yksityiskohdat tapahtumanäytöstä)";

/* status bar message when page load finishes with a single error */
"Completed opening the page with 1 error (see Activity window for details)" = "Sivun avaaminen päättynyt 1 virheellä (katso yksityiskohdat tapahtumanäytöstä)";

/* message for status bar when busy looking for a particular host */
"Contacting “%@”" = "Otetaan yhteyttä ”%@” ";

/* message for status bar when busy looking for a particular host via a proxy server */
"Contacting “%@” via proxy “%@”" = "Otetaan yhteyttä ”%@” välipalvelimen ”%@” kautta";

/* Title for default button in unknown root warning sheet */
"Continue" = "Jatka";

/* BrowserDiskCopyCopyingFailed description */
"Copy failed" = "Kopiointi epäonnistui";

/* Status field in Downloads when a DiskCopy image is copying. */
"Copying" = "Kopioin";

/* message for error sheet when we couldn't connect to a rendezvous server */
"Could not locate the rendezvous server “%@”." = "Ei löydetty rendezvous-palvelinta ”%@”.";

/* message of sheet displayed for WebFoundationErrorTimedOut. */
"Could not open the page “%@” after trying for %d seconds." = "Sivua “%@” ei voitu avata %d sekunnin yrittämisen jälkeen.";

/* Message of sheet displayed for WebFoundationErrorSecureConnectionFailed. */
"Could not open the page “%@” because Safari could not establish a secure connection to the server “%@”." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut luoda suojattua yhteyttä palvelimeen ”%@”.";

/* Message of sheet displayed for WebFoundationErrorServerCertificateHasBadDate. */
"Could not open the page “%@” because Safari could not establish a secure connection to the server “%@”. One or more of the certificates used to verify the identity of the website’s owner has an invalid date." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut luoda suojattua yhteyttä palvelimeen ”%@”. Yhdessä tai useammassa web-sivun omistajan tunnistamiseen käytetyssä sertifikaatissa on kelvoton päiväys.";

/* Message of sheet displayed for WebFoundationErrorServerCertificateHasBadDate. */
"Could not open the page “%@” because Safari could not establish a secure connection to the server “%@”. One or more of the certificates used to verify the identity of the website’s owner has an invalid date. You should upgrade to the latest version of Mac OS X, which provides improved security and might allow you to connect to this site." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut luoda suojattua yhteyttä palvelimeen ”%@”. Yhdessä tai useammassa web-sivun omistajan tunnistamiseen käytetyssä sertifikaatissa on kelvoton päiväys. Päivitä Mac OS X:n uusimpaan versioon, mikä tuo mukanaan parannettua turvallisuutta ja saattaa sallia yhteydenoton tähän sivustoon.";

/* Message of sheet displayed for WebFoundationErrorServerCertificateUntrusted. */
"Could not open the page “%@” because Safari could not establish a secure connection to the server “%@”. Safari cannot verify the certificate used to check the identity of the website’s owner." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut luoda suojattua yhteyttä palvelimeen ”%@”. Safari ei voi vahvistaa web-sivun omistajan tunnistamiseen käytettyä sertifikaattia.";

/* Message of sheet displayed for both WebFoundationErrorZeroByteResourceError and WebFoundationErrorResourceUnavailableError. */
"Could not open the page “%@” because Safari could not load any data for this location." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut ladata yhtään dataa sijainnista.";

/* message of sheet displayed for WebFoundationErrorCannotConnectToHostError. */
"Could not open the page “%@” because Safari couldn’t connect to the server “%@”." = "Sivua ”%@” ei voitu avata, koska Safari ei voinut ottaa yhteyttä palvelimeen ”%@”.";

/* Message of sheet displayed for WebFoundationErrorUnsupportedURL. */
"Could not open the page “%@” because Safari does not support redirecting to locations starting with “%@:”." = "Sivua ”%@” ei voida avata, koska Safari ei tue uudelleenreititystä sijaintiin, joka alkaa ”%@:”.";

/* Message of sheet displayed for WebFoundationErrorBadURLError. */
"Could not open the page “%@” because it’s an invalid address." = "Sivua ”%@” ei voida avata, koska osoite ei kelpaa.";

/* Message of sheet displayed for POSIX error ECONNRESET. */
"Could not open the page “%@” because the network connection was reset. This sometimes occurs when the server is busy." = "Sivua ”%@” ei voida avata, koska palvelinyhteys nollattiin. Tämä saattaa johtua siitä, että palvelin on varattu.";

/* Message of sheet displayed for WebFoundationErrorRedirectToNonExistentLocation. */
"Could not open the page “%@” because the page doesn’t exist. Make sure the address is correct." = "Sivua ”%@” ei voitu avata, koska sitä ei ole olemassa. Tarkista osoite.";

/* message of sheet displayed for WebFoundationErrorCannotFindHostError when the URL does not contain a valid server name. */
"Could not open the page “%@” because the server could not be found." = "Sivua ”%@” ei voitu avata, koska palvelinta ei löytynyt.";

/* message of sheet displayed for WebFoundationErrorCannotFindHostError. */
"Could not open the page “%@” because the server “%@” could not be found." = "Sivua ”%@” ei voitu avata, koska palvelinta ”%@” ei löytynyt.";

/* message of sheet displayed for WebFoundationErrorNotConnectedToInternetError. */
"Could not open the page “%@” because your computer isn’t connected to the Internet." = "Sivua ”%@” ei voitu avata, koska ei ole internet-yhteyttä.";

/* Message of sheet displayed for miscellaneous errors when a page could not be even partially loaded. */
"Could not open the page “%@”.\n\nThe error was: “%@” (%@:%d)\n\nPlease submit a bug report describing what you did before this message appeared." = "Sivua ”%@” ei voitu avata.\n\nVirhe: ”%@” (%@:%d)\n\nLähetä bugiraportti vaiheista, jotka edelsivät tätä ilmoitusta.";

/* Title of sheet displayed for miscellaneous errors when a page could not be even partially loaded */
"Could not open the page." = "Sivua ei voitu avata.";

/* Message of sheet displayed for miscellaneous errors when a page could not be even partially loaded and the URL of the failing page could not be determined. */
"Could not open the specified page. The error was: “%@” (%@:%d)\n\nPlease submit a bug report describing what you did before this message appeared." = "Kyseistä sivua ei voitu avata. Virhe: “%@” (%@:%d)\n\nLähetä bugiraportti vaiheista, jotka edelsivät tätä ilmoitusta.";

/* Alert title when trying to reveal a missing file from Downloads window */
"Could not show the file in the Finder." = "Tiedostoa ei voitu näyttää Finderissa.";

/* Alert message when user tries to reveal a downloaded file that has been moved */
"Could not show the file “%@” in the Finder because it moved since you downloaded it." = "Tiedostoa ”%@” ei voitu näyttää Finderissa, koska se on siirtynyt hakemisen jälkeen.";

/* Title of error sheet shown when the user clicks the Edit button for their AutoFill Address Book preference. */
"Couldn’t edit your Address Book card." = "Osoitekirjakorttia ei voitu muokata.";

/* message for error dialog displayed when a built-in file could not be located (bundle corruption?) */
"Couldn’t open %@.%@, because the file, which should be built-in, could not be found." = "Ei voitu avata %@.%@, koska tiedostoa, jonka pitäisi olla sisäänrakennettu, ei löytynyt.";

/* Title of error sheet shown when the user tries to launch the Address Book application and it fails to launch */
"Couldn’t open the Address Book application." = "Osoitekirja-ohjelmaa ei voitu avata.";

/* Status field in Downloads when Safari is decompressing a cpgz, zip file etc. */
"Decompressing" = "Puran";

/* BrowserBOMCopyFailed description */
"Decompression failed" = "Purku epäonnistui";

/* action name for Undo item when multiple bookmarks are deleted */
"Delete %d Bookmarks" = "Poista %d kirjanmerkkiä";

/* action name for Undo item when multiple history items are deleted */
"Delete %d History Entries" = "Poista %d historiamerkintää";

/* bookmark context menu item */
"Delete (bookmark context menu)" = "Poista";

/* action name for Undo item when 1 bookmark is deleted */
"Delete Bookmark" = "Poista kirjanmerkki";

/* title for confirmation alert */
"Delete Bookmarks Folder?" = "Poista kirjanmerkkikansio?";

/* button title in confirmation alert */
"Delete Folder" = "Poista kansio";

/* action name for Undo item when 1 history item is deleted */
"Delete History Entry" = "Poista historiamerkintä";

/* status bar text when the control key is held down, but not over a link */
"Display a menu" = "Näytä valikko";

/* status bar text when the control key is held down over a link with no title */
"Display a menu for “%@”" = "Näytä valikko kohteelle ”%@”";

/* status bar text when the control key is held down over a link with a title */
"Display a menu for “%@” <%@>" = "Näytä valikko kohteelle ”%@” <%@>";

/* Status field in Downloads when DiskCopy has displayed an SLA. */
"Displaying software license agreement" = "Näytä ohjelmistolisenssisopimuksen";

/* message for confirmation alert */
"Do you really want to delete the bookmarks folder “%@”?" = "Haluatko varmasti poistaa kirjanmerkkikansion ”%@”?";

/* Message asking whether to append extension on a filename which already seems to have an extension; %@ is the filename. */
"Document name %@ already seems to have an extension. Append ‘.txt’ anyway?" = "Dokumentilla %@ näyttää jo olevan tarkenne. Lisätäänkö ‘.txt’ silti?";

/* button title in download in progress alert */
"Don’t Quit" = "Älä lopeta";

/* second button title in default browser confirmation alert */
"Don’t Switch" = "Älä vaihda";

/* Response to the question asking whether to append '.txt' extension to a filename which already seems to have one */
"Don’t append" = "Älä lisää";

/* status bar text when over a link to a fragment on the current page (without a title) with the option key (and no command key) held down */
"Download #%@ of this page" = "Hae #%@ tältä sivulta";

/* Alert title for 1 download in progress */
"Download in progress" = "Hakuja käynnissä";

/* status bar text when over a link (without a title) with the option key (and no command key) held down */
"Download “%@”" = "Hae ”%@”";

/* status bar text when over a link to a fragment on the current page (with a title) with the option key (and no command key) held down */
"Download “%@” (#%@ of this page)" = "Hae ”%@” (#%@ tältä sivulta)";

/* status bar text when over a link (with a title) with the option key (and no command key) held down */
"Download “%@” <%@>" = "Hae ”%@” <%@>";

/* Alert title for n downloads in progress */
"Downloads in progress" = "Haku käynnissä";

/* menu title for submenu in Go menu that contains URLs visited earlier than the most recent few */
"Earlier Today" = "Aiemmin tänään";

/* bookmark context menu item */
"Edit Address" = "Muokkaa osoitetta";

/* bookmark context menu item */
"Edit Contents" = "Muokkaa sisältöä";

/* bookmark context menu item */
"Edit Name" = "Muokkaa nimeä";

/* button title in Empty Cache confirmation alert */
"Empty" = "Tyhjennä";

/* Button title in bug report sheet */
"Fewer Options" = "Vähemmän valintoja";

/* preference panel name */
"General" = "Yleiset";

/* Title for Go button in missing plug-in sheet */
"Go (missing plug-in sheet)" = "Siirry";

/* context menu item */
"Go To Address" = "Siirry osoitteeseen";

/* status bar text when over a link to a fragment on the current page (without a title) that targets another frame in the same window */
"Go to #%@ of this page in another frame" = "Siirry sivun kohtaan #%@ uudessa kehyksessä";

/* status bar text when over a link to a fragment on the current page (without a title) that targets another window */
"Go to #%@ of this page in another window" = "Siirry sivun kohtaan #%@ uudessa ikkunassa";

/* status bar text when over a link to a fragment on the current page without a title */
"Go to #%@ on this page" = "Siirry sivun kohtaan #%@";

/* hint text to show in page address field when empty */
"Go to this address" = "Siirry tähän osoitteeseen";

/* status bar text when over a link with no title */
"Go to “%@”" = "Siirry ”%@”";

/* status bar text when over a link to a fragment on the current page (with a title) that targets another frame in the same window */
"Go to “%@” (#%@ of this page) in another frame" = "Siirry kohtaan “%@” (#%@ tällä sivulla) uudessa kehyksessä";

/* status bar text when over a link to a fragment on the current page (with a title) that targets another window */
"Go to “%@” (#%@ of this page) in another window" = "Siirry kohtaan “%@” (#%@ tällä sivulla) uudessa ikkunassa";

/* status bar text when over a link to a fragment on the current page with a title */
"Go to “%@” (#%@) on this page" = "Siirry kohtaan ”%@” (#%@) tällä sivulla";

/* status bar text when over a link with a title */
"Go to “%@” <%@>" = "Siirry kohtaan ”%@” / <%@>";

/* status bar text when over a link (with a title) that targets another frame in the same window */
"Go to “%@” <%@> in another frame" = "Siirry kohtaan ”%@” / <%@> uudessa kehyksessä";

/* status bar text when over a link (with a title) that targets another window */
"Go to “%@” <%@> in another window" = "Siirry kohtaan ”%@” / <%@> uudessa ikkunassa";

/* status bar text when over a link (without a title) that targets another frame in the same window */
"Go to “%@” in another frame" = "Siirry kohtaan ”%@” uudessa kehyksessä";

/* status bar text when over a link (without a title) that targets another window */
"Go to “%@” in another window" = "Siirry kohtaan ”%@” uudessa ikkunassa";

/* hint text to show in search field when empty */
"Google" = "Google";

/* context menu item */
"Google Search" = "Google-haku";

/* menu item */
"Hide All Bookmarks" = "Kätke kaikki kirjanmerkit";

/* tooltip for show/hide bookmarks button */
"Hide all bookmarks." = "Kätke kaikki kirjanmerkit";

/* displayed title of special bookmark that shows History items */
"History (bookmark proxy)" = "Historia";

/* title for confirmation alert to switch default browser to Safari */
"If Safari is your default browser, clicking a link in Mail or another application opens the webpage in Safari. Would you like to do this?" = "Jos Safari on asetettu oletuselaimeksi, linkin osoittaminen Mail- tai toisessa ohjelmassa avaa sivun Safarissa. Haluatko tehdä näin?";

/* Imported IE Favorites folder name */
"Imported IE Favorites" = "Tuodut IE-suosikit";

/* Imported Netscape/Mozilla Favorites folder name */
"Imported Netscape/Mozilla Favorites" = "Tuodut Netscape/Mozilla-suosikit";

/* title of sheet for when you type a location that can't be turned into a URL */
"Invalid location" = "Kelvoton sijainti";

/* Title for sheet that appears when java is unavailable */
"Java is unavailable." = "Java ei ole käytettävissä.";

/* title of JavaScript alert panel */
"JavaScript" = "JavaScript";

/* for display in column of global history outline */
"Last Visited Today" = "Käyty viimeksi tänään";

/* label of tab when tab is loading */
"Loading (tab)" = "Lataan";

/* window title while page with no title or URL is loading */
"Loading (window)" = "Lataan";

/* window title while page is loading */
"Loading “%@”" = "Lataan ”%@”";

/* message for status bar when either loading a URL without a remote host, or already found host and loading */
"Loading “%@”, completed %@" = "Lataan ”%@”, %@ valmiina";

/* Button title in bug report sheet */
"More Options" = "Lisävalinnat";

/* Status field in Downloads when a DiskCopy image is mounting. */
"Mounting" = "Tuon näkyviin";

/* BrowserDiskCopyMountingFailed description */
"Mounting failed" = "Tuonti näkyviin epäonnistui";

/* action name for Undo item when multiple bookmarks have been dragged within the bookmarks view */
"Move %d Bookmarks" = "Siirrä %d kirjanmerkkiä";

/* action name for Undo item when 1 bookmark has been dragged within the bookmarks view */
"Move Bookmark" = "Siirrä kirjanmerkki";

/* action name for Undo item when a bookmark name has been changed */
"Name Change" = "Nimen muutos";

/* Third response to sheet when submitting a form with login information */
"Never for this Website" = "Ei koskaan tälle web-sivulle";

/* verb for New Folder, used as button label and Undo action string */
"New Folder" = "Uusi kansio";

/* context menu item */
"New Tab" = "Uusi välilehti";

/* dimmed menu item for empty Rendezvous case */
"No Rendezvous websites available" = "Rendezvous-sivustoja ei saatavilla";

/* tool tip used for favorite bar bookmarks that have no URL */
"No address specified" = "Osoitetta ei määritelty";

/* title of sheet for when try to go with no location */
"No address specified." = "Osoitetta ei määritelty.";

/* dimmed menu item for empty bookmarks toolbar case */
"No bookmarks in bar" = "Palkissa ei kirjanmerkkejä";

/* message for file URL for nonexistent file */
"No file exists at “%@”." = "Ei tiedostoa kohteessa ”%@”.";

/* dimmed menu item for empty address book case */
"No home pages in Address Book" = "Ei kotisivuja Osoitekirjassa";

/* Label for only item in menu that appears when clicking on the search field image, when no searches have been performed */
"No recent searches" = "Ei äskeisiä hakuja";

/* popup menu choice for default style sheet */
"None Selected (style sheet)" = "Ei valintaa";

/* Second response to sheet when submitting a form with login information */
"Not Now" = "Ei nyt";

/* title of sheet displayed for WebFoundationErrorNotConnectedToInternetError */
"Not connected to Internet." = "Ei internet-yhteyttä.";

/* status text in Find dialog when a search found nothing */
"Not found" = "Ei löytynyt";

/* Title of sheet shown when AutoFill finds no form to operate on. */
"Nothing to AutoFill." = "Ei lomaketta täytettäväksi AutoFillillä.";

/* status text in Find dialog when there is no responder that supports searching */
"Nowhere to search" = "Ei kohteita hakuun";

/* status bar text when over a link to a fragment on the current page (without a title) with the command key held down in tabbed browsing mode */
"Open #%@ of this page in a new tab" = "Avaa sivun kohde #%@ uudessa välilehdessä";

/* status bar text when over a link to a fragment on the current page (without a title) with the shift and command keys held down in tabbed browsing mode */
"Open #%@ of this page in a new tab behind the current one" = "Avaa sivun kohde #%@ uudessa välilehdessä nykyisen takana";

/* status bar text when over a link to a fragment on the current page (without a title) that always creates a new window or with the command key held down */
"Open #%@ of this page in a new window" = "Avaa sivun kohde #%@ uudessa ikkunassa";

/* status bar text when over a link to a fragment on the current page (without a title) with the shift and command keys held down */
"Open #%@ of this page in a new window behind the current window" = "Avaa sivun kohde #%@ uudessa ikkunassa nykyisen takana";

/* bookmark context menu item */
"Open (bookmark context menu)" = "Avaa";

/* menu item */
"Open Address Book" = "Avaa Osoitekirja";

/* context menu item */
"Open Link in New Tab" = "Avaa linkki uudessa välilehdessä";

/* bookmark context menu item */
"Open in New Tab (bookmark context menu)" = "Avaa uudessa välilehdessä";

/* bookmark context menu item */
"Open in New Window (bookmark context menu)" = "Avaa uudessa ikkunassa";

/* bookmark context menu item and folder menu item */
"Open in Tabs" = "Avaa välilehdillä";

/* context menu item */
"Open with QuickTime Player" = "Avaa QuickTime Playerin avulla";

/* context menu item */
"Open with iTunes" = "Avaa iTunesin avulla";

/* status bar text when over a link to a fragment on the current page (with a title) with the command key held down in tabbed browsing mode */
"Open “%@” (#%@ of this page) in a new tab" = "Avaa kohde ”%@” (#%@ tältä sivulta) uudessa välilehdessä";

/* status bar text when over a link to a fragment on the current page (with a title) with the shift and command keys held down in tabbed browsing mode */
"Open “%@” (#%@ of this page) in a new tab behind the current one" = "Avaa kohde ”%@” (#%@ tältä sivulta) uudessa välilehdessä nykyisen takana";

/* status bar text when over a link to a fragment on the current page (with a title) that always creates a new window or with the command key held down */
"Open “%@” (#%@ of this page) in a new window" = "Avaa kohde ”%@” (#%@ tältä sivulta) uudessa ikkunassa";

/* status bar text when over a link to a fragment on the current page (with a title) with the shift and command keys held down */
"Open “%@” (#%@ of this page) in a new window behind the current window" = "Avaa kohde ”%@” (#%@ tältä sivulta) uudessa ikkunassa nykyisen takana";

/* status bar text when over a link (with a title) with the command key held down in tabbed browsing mode */
"Open “%@” <%@> in a new tab" = "Avaa ”%@” <%@> uudessa välilehdessä";

/* status bar text when over a link (with a title) with the shift and command keys held down in tabbed browsing mode */
"Open “%@” <%@> in a new tab behind the current one" = "Avaa kohde ”%@” <%@> uudessa välilehdessä nykyisen takana";

/* status bar text when over a link (with a title) that always creates a new window or with the command key held down */
"Open “%@” <%@> in a new window" = "Avaa kohde ”%@” <%@> uudessa ikkunassa";

/* status bar text when over a link (with a title) with the shift and command keys held down */
"Open “%@” <%@> in a new window behind the current window" = "Avaa kohde ”%@” <%@> uudessa ikkunassa nykyisen takana";

/* status bar text when over a link (without a title) with the command key held down in tabbed browsing mode */
"Open “%@” in a new tab" = "Avaa ”%@” uudessa välilehdessä";

/* status bar text when over a link (without a title) with the shift and command keys held down in tabbed browsing mode */
"Open “%@” in a new tab behind the current one" = "Avaa ”%@” uudessa välilehdessä nykyisen takana";

/* status bar text when over a link (without a title) that always creates a new window or with the command key held down */
"Open “%@” in a new window" = "Avaa ”%@” uudessa ikkunassa";

/* status bar text when over a link (without a title) with the shift and command keys held down */
"Open “%@” in a new window behind the current window" = "Avaa ”%@” uudessa ikkunassa nykyisen takana";

/* popup menu choice for download location */
"Other... (download location)" = "Muu…";

/* popup menu choice for default style sheet */
"Other... (style sheet)" = "Muu…";

/* title of sheet displayed for WebFoundationErrorRedirectToNonExistentLocation */
"Page not found." = "Sivua ei löytynyt.";

/* Marker in Password viewing prefs sheet for a site for which we never save passwords. */
"Passwords Never Saved" = "Salasanoja ei koskaan tallennettu";

/* action name for Undo item when multiple bookmarks are pasted */
"Paste %d Bookmarks" = "Sijoita %d kirjanmerkkiä";

/* action name for Undo item when 1 bookmark is pasted */
"Paste Bookmark" = "Sijoita kirjanmerkki";

/* panel title for file URL with insufficient permissions */
"Permission denied." = "Ei oikeutta.";

/* Title for sheet that appears when an unknown plug-in error occurred */
"Plug-in error occurred" = "Tapahtui plug-in-virhe";

/* Title for sheet that appears when a page specifies a plug-in that's not installed */
"Plug-in not found." = "Plug-iniä ei löytynyt.";

/* Title for sheet that appears when a page has unsupported Windows Media Player or RealPlayer content. */
"Plug-in not supported" = "Plug-iniä ei tueta";

/* Status field in Downloads when a DiskCopy image is preparing to decompress. */
"Preparing to decompress" = "Valmistelen purkamista";

/* Status field in Downloads when the download has just started. */
"Preparing to download" = "Valmistelen hakua";

/* context menu item */
"Print Frame…" = "Tulosta kehys…";

/* context menu item */
"Print Page…" = "Tulosta sivu…";

/* title of dialog that appears when an unexpected error occurs while trying to save bookmarks to disk */
"Problem saving bookmarks." = "Ongelmia kirjanmerkkien tallennuksessa.";

/* button title in download in progress alert */
"Quit" = "Lopeta";

/* label for first item in the menu that appears when clicking on the search field image, used as embedded menu title */
"Recent Searches" = "Edelliset haut";

/* title off sheet displayed for WebFoundationErrorUnsupportedURL */
"Redirected to unsupported page." = "Uudelleenohjattu sivulle, jota ei tueta.";

/* context menu item */
"Reload All Tabs" = "Lataa kaikki välilehdet uudelleen";

/* context menu item */
"Reload Tab" = "Lataa välilehti uudelleen";

/* tooltip for stop/reload button */
"Reload the current page." = "Lataa nykyinen sivu uudelleen";

/* ToolTip for reload button in Downloads */
"Reload “%@”." = "Lataa ”%@” uudelleen";

/* button title in Remove All Cookies confirmation alert */
"Remove All" = "Poista kaikki";

/* submenu title in Bookmarks menu */
"Rendezvous" = "Rendezvous";

/* displayed title of special bookmark that shows Rendezvous items */
"Rendezvous (bookmark proxy)" = "Rendezvous";

/* title for error sheet when we couldn't connect to a rendezvous server */
"Rendezvous server not found." = "Rendezvous-palvelinta ei löydy.";

/* button title in Reset Safari confirmation alert */
"Reset" = "Nollaa";

/* message for Reset Safari confirmation alert */
"Resetting Safari erases your browsing history, empties the cache, clears the Downloads window, and removes cookies. It also removes any saved names and passwords or other AutoFill text and clears Google search entries." = "Safarin nollaus poistaa selainhistorian, tyhjentää välimuistin, tyhjentää hakuikkunan ja poistaa evästeet. Myös tallennetut nimet, salasanat sekä AutoFill-tekstit poistetaan mukaan lukien Googlen haun syötöt.";

/* status bar text when over a javascript: link with no title */
"Run script “%@”" = "Suorita skripti ”%@”";

/* status bar text when over a javascript: link with a title */
"Run script “%@” <%@>" = "Suorita skripti ”%@” <%@>";

/* Title of alert when Safari Beta has expired. */
"Safari Beta has expired" = "Safarin Beta-versio on vanhentunut";

/* Message of alert when Safari Beta has expired. */
"Safari Beta has expired." = "Safarin Beta-versio on vanhentunut.";

/* Title of alert when Safari Beta will expire. */
"Safari Beta will expire" = "Safarin Beta-versio vanhenee";

/* Message of alert when Safari Beta will expire in less than a day. */
"Safari Beta will expire in less than a day." = "Safarin Beta-versio vanhenee alle päivässä.";

/* Message of alert when Safari Beta will expire in less than a week. */
"Safari Beta will expire in less than a week." = "Safarin Beta-versio vanhenee alle viikossa.";

/* Keychain label for password used to access saved encrypted form autofill data.  Be brief. */
"Safari Forms AutoFill" = "Safarin lomakkeiden AutoFill";

/* Title of sheet displayed for HTTPS can't connect/continue anyway dialog. */
"Safari could not verify the identity of the website “%@”." = "Safari ei voinut vahvistaa web-sivua ”%@”.";

/* Alert message when user quits when n files are downloading */
"Safari is currently downloading %d files. If you quit now, downloading these files will not finish. Do you want to quit anyway?" = "Safari hakee tällä hetkellä %d tiedostoa. Jos lopetat nyt, näiden tiedostojen haku päättyy. Haluatko kuitenkin lopettaa?";

/* Alert message when user quits when 1 file is downloading */
"Safari is currently downloading “%@”. If you quit now, downloading this file will not finish. Do you want to quit anyway?" = "Safari hakee tällä hetkellä tiedostoa ”%@”. Jos lopetat nyt, tätä tiedostoa ei haeta kokonaan. Haluatko kuitenkin lopettaa?";

/* message for Empty Cache confirmation alert */
"Safari saves the contents of web pages you open in a cache so that it’s faster to visit them again." = "Safari säilyttää avattujen sivustojen sisällön välimuistissa, joten niiden avaaminen uudelleen on nopeampaa.";

/* context menu item */
"Save Frame As…" = "Tallenna kehys nimellä…";

/* context menu item */
"Save Page As…" = "Tallenna sivu nimellä…";

/* Title of save and alert panels when saving plain text */
"Save Plain Text" = "Tallenna pelkkänä tekstinä";

/* Sheet message when submitting a form with login information */
"Saved passwords can be reviewed and removed in the AutoFill preferences." = "Tallennettuja salasanoja voidaan katsella ja poistaa AutoFill-asetuksissa.";

/* does not show up in the UI any more */
"Search the web with Google" = "Etsi webistä Googlen avulla";

/* preference panel name */
"Security" = "Turvallisuus";

/* button label when choosing default web browser in Preferences */
"Select (default web browser)" = "Valitse";

/* button label in open panel for choosing download folder */
"Select (download location)" = "Valitse";

/* prompt when choosing default web browser in Preferences */
"Select an Application" = "Valitse sovellus";

/* Title for default button in insecure form warning sheet */
"Send" = "Lähetä";

/* status bar text when over a mailto: link with no title */
"Send email to %@" = "Lähetä sähköpostia osoitteeseen %@";

/* status bar text when over a mailto: link with a title */
"Send email to “%@” <%@>" = "Lähetä sähköpostia osoitteeseen ”%@” <%@>";

/* title of sheet displayed for WebFoundationErrorCannotFindHostError */
"Server not found." = "Palvelinta ei löytynyt.";

/* menu item title in back/forward menu after you do Open in Tabs */
"Set of Tabs" = "Välilehtien kokoelma";

/* menu item */
"Show All Bookmarks" = "Näytä kaikki kirjanmerkit";

/* tooltip for show/hide bookmarks button */
"Show all bookmarks." = "Näytä kaikki kirjanmerkit";

/* ToolTip for reveal button in Downloads */
"Show “%@” in the Finder." = "Näytä ”%@” Finderissa";

/* tooltip for button at right side of search field */
"SnapBack to last search results." = "SnapBack edelliseen hakutulokseen";

/* tooltip for button at right side of location field */
"SnapBack to “%@”." = "SnapBack kohteeseen ”%@”";

/* Title of HTML source window */
"Source of %@" = "Kohteen %@ lähde";

/* ToolTip for stop button in Downloads when the download is decompressing */
"Stop decompressing “%@”." = "Lopeta kohteen ”%@” purku";

/* ToolTip for stop button in Downloads when the download is downloading */
"Stop downloading “%@”." = "Lopeta kohteen ”%@” haku";

/* tooltip for stop/reload button */
"Stop loading this page." = "Lopeta sivun lataaminen";

/* default button title in default browser confirmation alert */
"Switch" = "Vaihda";

/* preference panel name */
"Tabs" = "Välilehdet";

/* Message in error sheet shown when the user tries to launch the Address Book application and it fails to launch */
"The Address Book application is unavailable or not installed." = "Osoitekirja-ohjelma ei ole käytettävissä tai sitä ei ole asennettu.";

/* message for file URL for folder that can’t be opened */
"The Finder could not open the folder at “%@”" = "Finder ei voinut avata kansiota kohteessa ”%@”";

/* Message for sheet that appears when a page attempts to load a plug-in that fails to load. */
"The page “%@” attemped to load a plug-in named “%@”, but the plug-in failed to load successfully." = "Sivu ”%@” yritti hakea ”%@”-nimistä plug-inia, mutta plug-inin haku ei onnistunut.";

/* Message for sheet that appears when a page attempts to load a plug-in with an unknown name that fails to load. */
"The page “%@” attemped to load a plug-in, but the plug-in failed to load successfully." = "Sivu ”%@” yritti hakea plug-inia, mutta plug-inin haku ei onnistunut.";

/* Message for sheet that appears when a page attemps to load Java, but Java is unavailable. */
"The page “%@” attempted to load Java content, but Java is unavailable or not installed." = "Sivu ”%@” yritti hakea Java-sisältöä, mutta Java ei ole käytettävissä tai sitä ei ole asennettuna.";

/* Message for sheet that appears when a page attempts to load a plug-in but an unknown plug-in occurred. */
"The page “%@” has attempted to load a plug-in, but a plug-in error occurred." = "Sivu ”%@” on yrittänyt hakea plug-inia, mutta tapahtui plug-in-virhe.";

/* Message for sheet that appears when a page has contents for a specified MIME type for which no plug-ins are installed, and a plug-in page location is specified */
"The page “%@” has content of MIME type “%@”. You do not have a plug-in installed for this MIME type, but one should be available on this page:\n\n%@\n\nDo you want to open the page?" = "Sivulla ”%@” on sisältöä MIME-tyypille ”%@”. Sinulla ei ole tähän MIME-tyyppiin tarvittavaa plug-inia, mutta sellainen pitäisi löytyä sivulta:\n\n%@\n\nHaluatko avata sivun?";

/* Message for sheet that appears when a page has contents for a specified MIME type for which no plug-ins are installed, and no plug-in page location is specified */
"The page “%@” has content of MIME type “%@”. You do not have a plug-in installed for this MIME type, so this content can not be displayed." = "Sivulla ”%@” on sisältöä MIME-tyypille ”%@”. Sinulla ei ole MIME-tyypille asennettua plug-inia, joten sisältöä ei voida näyttää.";

/* Message for sheet that appears when a page has contents for an unspecified MIME type for which no plug-ins are installed, and no plug-in page location is specified */
"The page “%@” has content of an unspecified MIME type. You do not have a plug-in installed for this MIME type, so this content can not be displayed." = "Sivu ”%@” sisältää määrittelemätöntä MIME-tyyppiä. Sinulla ei ole MIME-tyypin vaatimaa plug-inia asennettuna, joten sisältöä ei voida näyttää.";

/* Message for sheet that appears when a page has contents for an unspecified MIME type for which no plug-ins are installed, and a plug-in page location is specified */
"The page “%@” has content that requires a plug-in. You do not have a plug-in installed for this MIME type, but one should be available on this page:\n\n%@\n\nDo you want to open the page?" = "Sivulla ”%@” on sisältöä, joka vaatii plug-inin. Sinulla ei ole MIME-tyypin tarvitsemaa plug-inia asennettuna, mutta sellainen pitäisi löytyä sivulta:\n\n%@\n\nHaluatko avata sivun?";

/* message for panel for bad bookmark */
"The specified address “%@” is not a valid location." = "Määritelty osoite ”%@” ei ole kelvollinen.";

/* Message of sheet displayed for NSURLErrorServerCertificateHasUnknownRoot. */
"The website’s certificate is expired or not yet valid. You might be connecting to a website that is pretending to be “%@” which could put your confidential information at risk. Would you like to continue anyway?" = "Web-sivun sertifikaatti on vanhentunut tai ei vielä voimassa. Saatat olla yhteydessä web-sivuun, joka esittää olevansa ”%@”. Tämä saattaa vaarantaa tärkeitä tietojasi. Haluatko jatkaa kuitenkin?";

/* Message of sheet displayed for NSURLErrorServerCertificateUntrusted. */
"The website’s certificate is invalid. You might be connecting to a website that is pretending to be “%@” which could put your confidential information at risk. Would you like to continue anyway?" = "Web-sivun sertifikaatti ei ole kelvollinen. Saatat olla yhteydessä web-sivuun, joka esittää olevansa ”%@”. Tämä saattaa vaarantaa tärkeitä tietojasi. Haluatko jatkaa kuitenkin?";

/* Message of sheet displayed for NSURLErrorServerCertificateHasUnknownRoot. */
"The website’s certificate was signed by an unknown certifying authority. You might be connecting to a website that is pretending to be “%@” which could put your confidential information at risk. Would you like to continue anyway?" = "Web-sivun sertifikaatin on signeerannut tuntematon taho. Saatat olla yhteydessä web-sivuun, joka esittää olevansa ”%@”. Tämä saattaa vaarantaa tärkeitä tietojasi. Haluatko jatkaa kuitenkin?";

/* mesage for panel for bad bookmark */
"This bookmark has no address specified." = "Tällä kirjanmerkillä ei ole määriteltyä osoitetta.";

/* Message for insecure form warning sheet */
"This form will be sent in a way that is not secure. Are you sure you want to send it?" = "Lomake lähetetään tavalla, joka ei ole turvallinen. Haluatko kuitenkin lähettää sen?";

/* Title for insecure form warning sheet */
"This is a non-secure form." = "Tämä lomake ei ole turvallinen.";

/* Message for sheet that appears when a page has unsupported Windows Media Player or RealPlayer content */
"This page has plug-in content that Safari does not support. The application “%@” may be able to display this content. Would you like to try?" = "Tällä sivulla on plug-in-sisältöä, jota Safari ei tue. Sovellus ”%@” saattaa pystyä esittämään sisällön. Haluatko yrittää?";

/* Message for sheet warning of re-posting form data */
"To reopen this page, the form you completed to open the page the first time must be sent again. This may cause the website to repeat actions it took the first time you sent the form." = "Jos haluat avata sivun uudelleen, sinun täytyy lähettää sivun avaamiseen käytetty lomake uudelleen. Web-sivu saattaa toistaa tiettyjä toimintoja, joita on tehty kun sivu on avattu ensimmäisen kerran.";

/* Date format for today */
"Today" = "Tänään";

/* Date format for today, to be followed by time */
"Today " = "Tänään";

/* Message of sheet displayed for WebFoundationErrorHTTPTooManyRedirectsError. */
"Too many redirects occurred trying to open “%@”. This might occur if you open a page that is redirected to open another page which then is redirected to open the original page." = "Liian monta uudelleenohjausta avattaessa sivua ”%@”. Tämä saattaa tapahtua jos avataan sivu, joka on uudelleenohjattu avaamaan sivu, joka on puolestaan uudelleenohjattu avaamaan alkuperäinen sivu.";

/* message for sheet when you hit return in the search field with no search text */
"Type a word or phrase in the Google search box, then press Return." = "Kirjoita sana tai lause Googlen hakukenttään ja paina rivinvaihtonäppäintä.";

/* message for sheet for when try to go with no location */
"Type the address for the web page you would like to open." = "Kirjoita avattavan web-sivun osoite.";

/* Title for sheet that appears when a plug-in fails to load */
"Unable to load plug-in." = "Plug-inin lataaminen epäonnistui.";

/* Status field in Downloads when a DiskCopy image is unmounting. */
"Unmounting" = "Poistan näkyvistä";

/* Keychain comment describing the password entry we use to access saved encrypted form autocomplete data. */
"Used to decode the encrypted file that contains non-password data previously entered in web page forms." = "Käytetään koodatun tiedoston purkamiseen, joka sisältää salasanasuojaamatonta sisältöä, jota on aiemmin syötetty web-sivun lomakkeella.";

/* BrowserDiskCopyVerificationFailed description */
"Verification failed" = "Verifiointi epäonnistui";

/* Status field in Downloads when a DiskCopy image is verifying. */
"Verifying" = "Verifioin";

/* context menu item */
"View Frame Source" = "Näytä kehyksen lähde";

/* context menu item */
"View Source" = "Näytä lähde";

/* Message for confirmation sheet when user checks 'Block pop-up windows' */
"Web pages may automatically open pop-up windows to display information, as well as advertising. This feature blocks these pop-up windows. This does not prevent opening desired windows by clicking buttons or links." = "Web-sivut saattavat automaattisesti näyttää ponnahdusikkunoita sekä ilmoituksia. Tämä toiminto estää nämä ikkunat. Tämä ei estä haluttujen ikkunoiden avaamista painikkeilla tai linkeillä.";

/* title for confirmation alert to switch default browser to Safari */
"Would you like to make Safari your default browser?" = "Haluatko asettaa Safarin oletusselaimeksi?";

/* Sheet title when submitting a form with login information */
"Would you like to replace your saved password with this one?" = "Haluatko korvata tallennetun salasanan tällä?";

/* Sheet title when submitting a form with login information */
"Would you like to save this password?" = "Haluatko tallentaa tämän salasanan?";

/* Default response to sheet when submitting a form with login information */
"Yes" = "Kyllä";

/* Date format for yesterday */
"Yesterday" = "Eilen";

/* Date format for yesterday, to be followed by time */
"Yesterday " = "Eilen ";

/* title of dialog that appears when a user tries to modify bookmarks while iSync is synching them */
"You cannot change bookmarks now." = "Et voi nyt vaihtaa kirjanmerkkejä.";

/* message for Remove All Cookies confirmation alert */
"You cannot undo this action." = "Toimintoa ei voida perua.";

/* message for file URL with insufficient permissions */
"You don’t have the right permissions to view “%@”." = "Sinulla ei ole oikeuksia katsella ”%@”.";

/* title of sheet when you hit return in the search field with no search text */
"You haven't entered text in the Google search box." = "Et ole syötänyt tekstiä Googlen hakukenttään.";

/* message for error message when syncing can't be configured in Bookmarks preferences */
"You must install iSync 1.1 or newer before you can synchronize your bookmarks." = "Sinun täytyy asentaa iSync 1.1 tai uudempi ennen kuin voit synkronoida kirjanmerkit.";

/* title of dialog that appears when a user tries to modify bookmarks but an external process has modified the bookmarks file */
"Your bookmarks could not be changed. Try again." = "Kirjanmerkkejäsi ei voida muuttaa. Yritä uudelleen.";

/* message of dialog that appears when a user tries to modify bookmarks but an external process has modified the bookmarks file */
"Your bookmarks have been changed by another program since you opened Safari, so Safari needed to update your bookmarks before making any additional changes. You can now make your changes." = "Toinen ohjelma on muuttanut kirjanmerkkejäsi Safarin avaamisen jälkeen, joten Safarin on täytynyt päivittää kirjanmerkkejäsi ennen lisämuutosten tekemistä. Voit nyt tehdä tarvittavat muutokset.";

/* string put on pasteboard for selected bookmarks folder */
"bookmarks folder “%@”" = "kirjanmerkkikansio ”%@”";

/* status text for Activity window for cancelled page */
"cancelled" = "kumottu";

/* Label for only item in menu that appears when clicking on an empty Favorites bar folder */
"empty" = "tyhjä";

/* short description used in Activity window for error codes that have no textual description */
"error" = "virhe";

/* URL string of the apple web site that explains Rendezvous */
"http://www.apple.com/macosx/jaguar/rendezvous.html" = "http://www.apple.com/macosx/jaguar/rendezvous.html";

/* title for error message when syncing can't be configured in Bookmarks preferences */
"iSync 1.1 or newer required." = "Vaaditaan iSync 1.1 tai uudempi.";

/* message of dialog that appears when a user tries to modify bookmarks while iSync is synching them */
"iSync is synchronizing your bookmarks so you cannot change them. Try again in a moment." = "iSync synkronoi kirjanmerkkejäsi, joten et voi muuttaa niitä. Yritä hetken päästä uudelleen.";

/* in cookies table for cookies that are not secure */
"no" = "ei";

/* menu title used for a URL when no other title can be determined, not even one based on the URL */
"unknown (bookmark menu item title)" = "tuntematon";

/* fallback string used when an error has no description */
"unknown error" = "tuntematon virhe";

/* title shown for History entries with no HTML title */
"unknown title" = "tuntematon otsikko";

/* name for newly created bookmark folders */
"untitled folder" = "nimetön kansio";

/* in cookies table for cookies that are secure */
"yes" = "kyllä";

/* message for sheet for when you type a location that can't be turned into a URL */
"“%@” is not a valid location." = "”%@” ei ole kelvollinen sijainti.";

